FMWebService_VT/WebRoot/WEB-INF/wsdl/molistenerService.wsdl

<?xml version="1.0" encoding="UTF-8"?><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.1.3-hudson-390-. --><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://mtws/xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="molistenerService" targetNamespace="http://mtws/xsd">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://mtws/xsd" schemaLocation="MolistenerService_schema1.xsd"/>
    </xsd:schema>
  </types>
  <message name="moRequest">
    <part element="tns:moRequest" name="parameters"/>
  </message>
  <message name="moRequestResponse">
    <part element="tns:moRequestResponse" name="parameters"/>
  </message>
  <portType name="molistenerDelegate">
    <operation name="moRequest">
      <input message="tns:moRequest"/>
      <output message="tns:moRequestResponse"/>
    </operation>
  </portType>
  <binding name="moRequestBinding" type="tns:molistenerDelegate">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <operation name="moRequest">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="molistenerService">
    <port binding="tns:moRequestBinding" name="moRequest">
      <soap:address location="http://localhost:8080/FMWebService_VT/moRequest"/>
    </port>
  </service>
</definitions>
